In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({
    "name"  : ["hamza", "zaki", "amina", "abdo"],
    "grade" : ["A+"   , "A+"  , "A+"   , "A+"  ],
})

print(df)

    name grade
0  hamza    A+
1   zaki    A+
2  amina    A+
3   abdo    A+

In [4]:
df = pd.DataFrame([
    ["hamza", "A+"],
    ["zaki", "A+"],
    ["amina", "A+"],
    ["abdo", "A+"],
], columns=["name", "grade"])
print(df)

    name grade
0  hamza    A+
1   zaki    A+
2  amina    A+
3   abdo    A+

In [5]:
df = pd.read_csv("students.csv")

In [9]:
df.head(3)

      Name  Age Class  Grade
0    Alice   24     A     88
1      Bob   27     B     95
2  Charlie   22     A     70

In [11]:
df.tail(2)

   Name  Age Class  Grade
8   Ian   22     A     91
9  Jane   26     B     87

In [14]:
print(df.describe())

             Age      Grade
count  10.000000  10.000000
mean   23.700000  84.500000
std     1.888562   7.792446
min    21.000000  70.000000
25%    22.250000  79.750000
50%    23.500000  86.000000
75%    24.750000  90.250000
max    27.000000  95.000000

In [18]:
print(df[df.Age > 25])

   Name  Age Class  Grade
1   Bob   27     B     95
9  Jane   26     B     87